Тест/Тест/src/Documents/АктВозврата/АктВозврата.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>АктВозврата</name>
  <basedOn>Document.ПродажаЗапчастей</basedOn>
  <basedOn>Document.ЗаказНаряд</basedOn>
  <registerRecords>AccumulationRegister.РегистрНакопления1</registerRecords>
  <registerRecords>AccumulationRegister.ОплатыПоСделкам</registerRecords>
  <registerRecords>AccumulationRegister.Расходы</registerRecords>
  <registerRecords>AccumulationRegister.БалансКлиента</registerRecords>
  <attributes>
    <name>Продажа</name>
    <type>
      <types>DocumentRef.ПродажаЗапчастей</types>
      <types>DocumentRef.ЗаказНаряд</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СлужбаДоставки</name>
    <type>
      <types>CatalogRef.Доставка</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Кладовщик</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Разнесено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГородОтправки</name>
    <type>
      <types>CatalogRef.Город</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПрибытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СтатусыАктаВозврата</types>
    </type>
  </attributes>
  <attributes>
    <name>Инициатор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаВозврата</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Согласовал</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаВозврата2</name>
    <type>
      <types>CatalogRef.ПричинаВозврата</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Таблица</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>машина</name>
      <type>
        <types>CatalogRef.Машины</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПродНак</name>
      <type>
        <types>DocumentRef.ПоступлениеЗапчастей</types>
      </type>
    </attributes>
    <attributes>
      <name>укод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>CatalogRef.ИндКод</types>
      </type>
    </attributes>
    <attributes>
      <name>Отменено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>Артикул</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тест/Тест/src/AccumulationRegisters/РегистрНакопления1/РегистрНакопления1.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РегистрНакопления1</name>
  <resources>
    <name>Колво</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>машина</name>
    <type>
      <types>CatalogRef.Машины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>индкод</name>
    <type>
      <types>CatalogRef.ИндКод</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Тест/Тест/src/InformationRegisters/БонусыСотрудниковОтПродажи/БонусыСотрудниковОтПродажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>БонусыСотрудниковОтПродажи</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Бонус</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Роль</name>
    <type>
      <types>CatalogRef.ДолжностиДляУК</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Продажа</name>
    <type>
      <types>DocumentRef.ПродажаЗапчастей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументРег</name>
    <type>
      <types>DocumentRef.ПродажаЗапчастей</types>
      <types>DocumentRef.АктВозврата</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тест/Тест/src/Enums/СтатусыАктаВозврата/СтатусыАктаВозврата.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыАктаВозврата</name>
  <enumValues>
    <name>ОжидаемНаСклад</name>
  </enumValues>
  <enumValues>
    <name>ПринятоНаСкладе</name>
  </enumValues>
  <enumValues>
    <name>Разнесено</name>
  </enumValues>
  <enumValues>
    <name>ВозвратЗалога</name>
  </enumValues>
</mdclass:Enum>

Тест/Тест/src/Documents/АктВозврата/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПродажаЗапчастей") Тогда
		
		Дата		   = ТекущаяДата();
		Склад 		   = ДанныеЗаполнения.Склад;
		Клиент 	       = ДанныеЗаполнения.Клиент;
		Продажа 	   = ДанныеЗаполнения.Ссылка;
		Ответственный  = ДанныеЗаполнения.КтоПродал;
		СлужбаДоставки = ДанныеЗаполнения.Доставка;
		Инициатор 	   = Пользователи.ТекущийПользователь();
		Организация    = ДанныеЗаполнения.Организация;
		
		Для Каждого ТекСтрокаТаблица Из ДанныеЗаполнения.Таблица Цикл
			Если ТекСтрокаТаблица.Отменено Тогда
				НоваяСтрока = Таблица.Добавить();
				НоваяСтрока.Комментарий = ТекСтрокаТаблица.Комментарий;
				НоваяСтрока.Количество  = ТекСтрокаТаблица.Количество;
				НоваяСтрока.Отменено 	= ТекСтрокаТаблица.Отменено;
				НоваяСтрока.ПродНак 	= ТекСтрокаТаблица.ПродНак;
				НоваяСтрока.машина 		= ТекСтрокаТаблица.машина;
				НоваяСтрока.Партия 		= ТекСтрокаТаблица.Партия;
				НоваяСтрока.Скидка 		= ТекСтрокаТаблица.Скидка;
				НоваяСтрока.Склад 		= ДанныеЗаполнения.Склад;
				НоваяСтрока.Сумма 		= ТекСтрокаТаблица.Сумма;
				НоваяСтрока.Товар 		= ТекСтрокаТаблица.Товар;
				НоваяСтрока.укод 		= ТекСтрокаТаблица.Товар.Код; 
				НоваяСтрока.Цена		= ТекСтрокаТаблица.Цена;	
				НоваяСтрока.Артикул     = ТекСтрокаТаблица.Товар.Артикул;  
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	Если Состояние = Перечисления.СтатусыАктаВозврата.Разнесено Тогда	
		Движения.РегистрНакопления1.Записывать = Истина;
		
		Для Каждого ТекСтрокаТаблица Из Таблица Цикл
			Движение = Движения.РегистрНакопления1.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Колво  	 = ТекСтрокаТаблица.Количество;
			Движение.машина 	 = ТекСтрокаТаблица.машина;
			Движение.индкод 	 = ТекСтрокаТаблица.партия;
			Движение.Товар 	  	 = ТекСтрокаТаблица.Товар;
			Движение.Склад  	 = Склад;
			Движение.Период 	 = Дата;					
		КонецЦикла;	
	КонецЕсли
	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат
	КонецЕсли;
		
	
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	///+ГомзМА 29.07.2024
	Если Дата > '00010101' Тогда //Дата начала действия бонусов
		Сумма = РаботаСДокументамиВызовСервера.ПолучитьСуммуПродажи(Продажа);

		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	БонусыСотрудниковОтПродажи.Сотрудник КАК Сотрудник,
		|	БонусыСотрудниковОтПродажи.Период КАК Период
		|ИЗ
		|	РегистрСведений.БонусыСотрудниковОтПродажи КАК БонусыСотрудниковОтПродажи
		|ГДЕ
		|	БонусыСотрудниковОтПродажи.Продажа = &Продажа";

		Запрос.УстановитьПараметр("Продажа", Продажа);

		РезультатЗапроса = Запрос.Выполнить().Выбрать();

		Пока РезультатЗапроса.Следующий() Цикл
			ЗаписьВРегистреСведений = РегистрыСведений.БонусыСотрудниковОтПродажи.СоздатьМенеджерЗаписи();
			ЗаписьВРегистреСведений.Период 		= РезультатЗапроса.Период;
			ЗаписьВРегистреСведений.Сотрудник 	= РезультатЗапроса.Сотрудник;
			ЗаписьВРегистреСведений.Прочитать();
			Если ЗаписьВРегистреСведений.Выбран() Тогда
				ЗаписьВРегистреСведений.Сумма = Сумма;
			КонецЕсли;
			ЗаписьВРегистреСведений.Записать();
		КонецЦикла;
		 
		СписокУчастниковРаботы = РаботаСДокументамиВызовСервера.ПолучитьСписокУчастниковРаботы(Сделка.ЗаказКлиента);

		Для Каждого СтрокаТЧ Из СписокУчастниковРаботы Цикл
			ЗаписьВРегистреСведений = РегистрыСведений.БонусыСотрудниковОтПродажи.СоздатьМенеджерЗаписи();
			ЗаписьВРегистреСведений.Период 		= Дата;
			ЗаписьВРегистреСведений.Сотрудник 	= СтрокаТЧ.Сотрудник;
			ЗаписьВРегистреСведений.Сумма 		= Сумма;
			ЗаписьВРегистреСведений.Продажа 	= Сделка;
			ЗаписьВРегистреСведений.Роль 		= СтрокаТЧ.Роль;
			ЗаписьВРегистреСведений.Записать();
		КонецЦикла;

	КонецЕсли;
	///-ГомзМА 29.07.2024
	
КонецПроцедуры
